Eric-C-E/ESP32-LLL/main/app_display.c
/* 2025 Eric Liu
This program defines a freeRTOS task to drive two SPI displays. The displays are multiplexed with their CS pins. 
There is one SPI channel defined on SPI2, which drives LCD1 and LCD2 with their own io handles, panel handles, and LVGL objects.
In use is esp_lcd component for GC9A01 (primary disp) and NV3041A (secondary disp)


Inputs: Queue
Outputs: None
*/


#include "app_display.h"
#include "app_tcp.h"
#include "app_wifi.h"
#include "app_gpio.h"
#include <string.h>
#include <stdio.h>

#include "esp_err.h"
#include "esp_check.h"
#include "esp_log.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"

#include "driver/spi_master.h"
#include "driver/gpio.h"
#include "esp_lcd_gc9a01.h"
#include "esp_lcd_nv3041.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lvgl_port.h"

#if LV_FONT_MONTSERRAT_28
LV_FONT_DECLARE(lv_font_montserrat_28);
#endif

/* LCD SPI host and CLK */

#define LCD_HOST SPI2_HOST
#define LCD_PIXEL_CLOCK_HZ (32 * 1000 * 1000)


/* LCD PIN definitions */

#define PIN_NUM_MOSI 11
#define PIN_NUM_SCLK 12
#define PIN_NUM_CS 10
#define PIN_NUM_CS_2 17
#define PIN_NUM_DC 8
#define PIN_NUM_RST -1
#define PIN_NUM_RST_2 18
#define PIN_NUM_MISO -1

static const char *TAG = "display_task";

#define LCD_INVERT_COLORS true

/* LCD one and two specific definitions */
#define LCD_H_RES 240
#define LCD_V_RES 240
#define LCD_DRAW_BUF_HEIGHT 40
#define LCD_DRAW_BUF_DOUBLE 1
#define LCD_CMD_BITS 8
#define LCD_PARAM_BITS 8
#define LCD_BITS_PER_PIXEL 16
/*--------------------------------------*/
#define LCD_H_RES_2 480
#define LCD_V_RES_2 128
#define LCD_DRAW_BUF_DOUBLE_2 true
#define LCD_CMD_BITS_2 8
#define LCD_PARAM_BITS_2 8
#define LCD_BITS_PER_PIXEL_2 16
#define LCD_DRAW_BUF_HEIGHT_2 4
#define SCREEN2_SWAP_BYTES true
#define SCREEN2_LVGL_DMA true
/*--------------------------------------*/
#define DISPLAY_MAX_LINES 16
#define DISPLAY_LINE_MAX_AGE_MS 10000
/*--------------------------------------*/
#define DISPLAY_MAX_LINES_2 8
#define DISPLAY_LINE_MAX_AGE_MS_2 10000

/* lcd panel Ios */

static esp_lcd_panel_io_handle_t io_handle = NULL;
static esp_lcd_panel_handle_t panel_handle = NULL;

static esp_lcd_panel_io_handle_t io_handle_2 = NULL;
static esp_lcd_panel_handle_t panel_handle_2 = NULL;

/* lvgl display handles */

static lv_display_t *lvgl_disp = NULL;
static lv_display_t *lvgl_disp_2 = NULL;

static void screen2_fill_color(uint16_t color);

static int32_t min_i32(int32_t a, int32_t b)
{
    return (a < b) ? a : b;
}

static void create_logo_rect(lv_obj_t *parent, int32_t x, int32_t y, int32_t w, int32_t h)
{
    if (w <= 0 || h <= 0) {
        return;
    }
    lv_obj_t *rect = lv_obj_create(parent);
    lv_obj_remove_style_all(rect);
    lv_obj_set_pos(rect, x, y);
    lv_obj_set_size(rect, w, h);
    lv_obj_set_style_bg_color(rect, lv_color_white(), 0);
    lv_obj_set_style_bg_opa(rect, LV_OPA_COVER, 0);
}

static void create_logo_rect_rotated_ccw(lv_obj_t *parent,
                                         int32_t origin_x,
                                         int32_t origin_y,
                                         int32_t logo_w,
                                         int32_t logo_h,
                                         int32_t x,
                                         int32_t y,
                                         int32_t w,
                                         int32_t h)
{
    int32_t rx = y;
    int32_t ry = logo_w - (x + w);
    int32_t rw = h;
    int32_t rh = w;
    create_logo_rect(parent, origin_x + rx, origin_y + ry, rw, rh);
}

static void show_boot_logo(lv_display_t *disp, int32_t disp_w, int32_t disp_h, int rotate_ccw)
{
    if (!disp || disp_w <= 0 || disp_h <= 0) {
        return;
    }
    lv_display_t *prev = lv_display_get_default();
    lv_display_set_default(disp);
    lv_obj_t *scr = lv_scr_act();
    lv_obj_clean(scr);
    lv_obj_set_style_bg_color(scr, lv_color_black(), 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);

    int32_t base = min_i32(disp_w, disp_h);
    int32_t logo_w = (base * 60) / 100;
    int32_t logo_h = (disp_h * 70) / 100;
    if (logo_w < 24) {
        logo_w = 24;
    }
    if (logo_h < 24) {
        logo_h = 24;
    }
    int32_t gap = logo_h / 12;
    int32_t letter_h = (logo_h - (gap * 2)) / 3;
    if (letter_h < 8) {
        letter_h = 8;
        gap = 2;
        logo_h = (letter_h * 3) + (gap * 2);
    }
    int32_t thickness = letter_h / 4;
    if (thickness < 3) {
        thickness = 3;
    }
    if (thickness > letter_h) {
        thickness = letter_h;
    }

    int32_t draw_w = rotate_ccw ? logo_h : logo_w;
    int32_t draw_h = rotate_ccw ? logo_w : logo_h;
    int32_t logo_x = (disp_w - draw_w) / 2;
    int32_t logo_y = (disp_h - draw_h) / 2;

    for (int i = 0; i < 3; i++) {
        int32_t top = logo_y + i * (letter_h + gap);
        if (rotate_ccw) {
            int32_t local_top = i * (letter_h + gap);
            create_logo_rect_rotated_ccw(scr, logo_x, logo_y, logo_w, logo_h,
                                         0, local_top, thickness, letter_h);
            create_logo_rect_rotated_ccw(scr, logo_x, logo_y, logo_w, logo_h,
                                         0, local_top + letter_h - thickness, logo_w, thickness);
        } else {
            create_logo_rect(scr, logo_x, top, thickness, letter_h);
            create_logo_rect(scr, logo_x, top + letter_h - thickness, logo_w, thickness);
        }
    }

    lv_display_set_default(prev);
}

static void clear_display(lv_display_t *disp)
{
    if (!disp) {
        return;
    }
    lv_display_t *prev = lv_display_get_default();
    lv_display_set_default(disp);
    lv_obj_clean(lv_scr_act());
    lv_display_set_default(prev);
}

static void screen1_fill_color(uint16_t color)
{
    static uint16_t line[LCD_H_RES];
    if (!panel_handle || LCD_H_RES <= 0 || LCD_V_RES <= 0) {
        return;
    }
    for (int x = 0; x < LCD_H_RES; x++) {
        line[x] = color;
    }
    for (int y = 0; y < LCD_V_RES; y++) {
        esp_lcd_panel_draw_bitmap(panel_handle, 0, y, LCD_H_RES, y + 1, line);
    }
}

