Eric-C-E/ESP32-LLL/main/app_display.c
static void screen2_fill_color(uint16_t color)
{
    static uint16_t line[LCD_H_RES_2];
    if (!panel_handle_2 || LCD_H_RES_2 <= 0 || LCD_V_RES_2 <= 0) {
        ESP_LOGW(TAG, "screen2_fill_color skipped: panel_handle_2=%p", panel_handle_2);
        return;
    }
    for (int x = 0; x < LCD_H_RES_2; x++) {
        line[x] = color;
    }
    int err_count = 0;
    for (int y = 0; y < LCD_V_RES_2; y++) {
        esp_err_t ret = esp_lcd_panel_draw_bitmap(panel_handle_2, 0, y, LCD_H_RES_2, y + 1, line);
        if (ret != ESP_OK) {
            if (err_count == 0) {
                ESP_LOGE(TAG, "screen2_fill_color draw failed at y=%d: %s", y, esp_err_to_name(ret));
            }
            err_count++;
        }
    }
    if (err_count > 0) {
        ESP_LOGE(TAG, "screen2_fill_color errors: %d", err_count);
    }
}

typedef struct {
    TickType_t ts;
    char text[TEXT_BUF_SIZE + 1];
} log_line_t;

/* terminal line style rendering -> pad all space on top so new lines appear bottom */
/* safely discards excess transcript to avoid memory error                          */
static void rebuild_log_textarea(lv_obj_t *log_area, const log_line_t *lines, int line_count,
                                 int max_lines)
{
    static char log_text[1024];
    size_t pos = 0;
    size_t remaining = sizeof(log_text) - 1;

    int padding_lines = max_lines - line_count;
    for (int i = 0; i < padding_lines && remaining > 0; i++) {
        if (remaining == 0) {
            break;
        }
        log_text[pos++] = '\n';
        log_text[pos] = '\0';
        remaining--;
    }

    for (int i = 0; i < line_count && remaining > 0; i++) {
        size_t len = strnlen(lines[i].text, TEXT_BUF_SIZE);
        if (len > remaining) {
            len = remaining;
        }
        memcpy(log_text + pos, lines[i].text, len);
        pos += len;
        log_text[pos] = '\0';
        remaining -= len;
        if (i < line_count - 1 && remaining > 0) {
            log_text[pos++] = '\n';
            log_text[pos] = '\0';
            remaining--;
        }
    }

    lv_textarea_set_text(log_area, log_text);
    lv_textarea_set_cursor_pos(log_area, LV_TEXTAREA_CURSOR_LAST);
}

/* removes the oldest line for when the lines reach the top */
static void drop_oldest_line(log_line_t *lines, int *line_count)
{
    if (*line_count <= 0) {
        return;
    }
    for (int i = 1; i < *line_count; i++) {
        lines[i - 1] = lines[i];
    }
    (*line_count)--;
}

/* removes expired lines from the log; lifetime is defined by DISPLAY_LINE_MAX_AGE_MS */
static void prune_expired_lines(log_line_t *lines, int *line_count, TickType_t now)
{
    while (*line_count > 0 &&
           (now - lines[0].ts) > pdMS_TO_TICKS(DISPLAY_LINE_MAX_AGE_MS)) {
        drop_oldest_line(lines, line_count);
    }
}

static void prune_expired_lines_with_age(log_line_t *lines, int *line_count, TickType_t now,
                                         TickType_t max_age_ticks)
{
    while (*line_count > 0 &&
           (now - lines[0].ts) > max_age_ticks) {
        drop_oldest_line(lines, line_count);
    }
}

/* splits incoming log transcript to what fits, invokes functions to trim if needed     */
static void add_wrapped_lines(log_line_t *lines, int *line_count, int max_lines,
                              const char *text, TickType_t ts, const lv_font_t *font,
                              int32_t max_width, int32_t letter_space)
{
    size_t len = strnlen(text, TEXT_BUF_SIZE);
    size_t line_start = 0;
    int32_t line_width = 0;
    size_t line_len = 0;

    if (max_width < 1) {
        max_width = 1;
    }

    for (size_t i = 0; i < len; i++) {
        uint32_t letter = (uint8_t)text[i];
        uint32_t next = (i + 1 < len) ? (uint8_t)text[i + 1] : 0;
        int32_t glyph_width = lv_font_get_glyph_width(font, letter, next);
        int32_t next_width = line_width + glyph_width;

        if (line_len > 0 && next_width > max_width) {
            while (line_start < i && text[line_start] == ' ') {
                line_start++;
            }
            size_t seg_len = i - line_start;
            if (seg_len > 0) {
                while (*line_count >= max_lines) {
                    drop_oldest_line(lines, line_count);
                }
                lines[*line_count].ts = ts;
                size_t copy_len = (seg_len > TEXT_BUF_SIZE) ? TEXT_BUF_SIZE : seg_len;
                memcpy(lines[*line_count].text, text + line_start, copy_len);
                lines[*line_count].text[copy_len] = '\0';
                (*line_count)++;
            }
            line_start = i;
            line_width = 0;
            line_len = 0;
        }

        line_width += glyph_width + letter_space;
        line_len++;
    }

    if (line_len > 0) {
        while (line_start < len && text[line_start] == ' ') {
            line_start++;
        }
        if (line_start < len) {
            size_t seg_len = len - line_start;
            while (*line_count >= max_lines) {
                drop_oldest_line(lines, line_count);
            }
            lines[*line_count].ts = ts;
            size_t copy_len = (seg_len > TEXT_BUF_SIZE) ? TEXT_BUF_SIZE : seg_len;
            memcpy(lines[*line_count].text, text + line_start, copy_len);
            lines[*line_count].text[copy_len] = '\0';
            (*line_count)++;
        }
    }
}

esp_err_t app_lcd_init(void)
{
    esp_err_t ret = ESP_OK;

    esp_log_level_set(TAG, ESP_LOG_VERBOSE);
    esp_log_level_set("lcd_panel.gc9a01", ESP_LOG_VERBOSE);
    esp_log_level_set("lcd_panel.nv3041", ESP_LOG_VERBOSE);

    ESP_LOGD(TAG, "Initialize SPI bus");
    const spi_bus_config_t buscfg = {
        .miso_io_num = PIN_NUM_MISO,
        .mosi_io_num = PIN_NUM_MOSI,
        .sclk_io_num = PIN_NUM_SCLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = LCD_H_RES * LCD_DRAW_BUF_HEIGHT * sizeof(uint16_t),
    };
    ESP_RETURN_ON_ERROR(spi_bus_initialize(LCD_HOST, &buscfg, SPI_DMA_CH_AUTO), TAG, "Failed to initialize SPI bus");

    ESP_LOGD(TAG, "Install panel IO");
    const esp_lcd_panel_io_spi_config_t io_config = {
        .dc_gpio_num = PIN_NUM_DC,
        .cs_gpio_num = PIN_NUM_CS,
        .pclk_hz = LCD_PIXEL_CLOCK_HZ,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
        .spi_mode = 0,
        .trans_queue_depth = 10,
    };
    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_HOST, &io_config, &io_handle), err, TAG, "Failed to install panel IO");

    ESP_LOGD(TAG, "Install LCD panel driver");
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = PIN_NUM_RST,
        #if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
            .color_space = ESP_LCD_COLOR_SPACE_RGB,
        #elif ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0)
            .rgb_endian = LCD_RGB_ENDIAN_RGB,
        #else
            .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_BGR,
        #endif
            .bits_per_pixel = LCD_BITS_PER_PIXEL,
    };
    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_gc9a01(io_handle, &panel_config, &panel_handle), err, TAG, "New panel failed");
    ESP_ERROR_CHECK(esp_lcd_panel_reset(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle, true));
    ESP_ERROR_CHECK(esp_lcd_panel_invert_color(panel_handle, LCD_INVERT_COLORS));

    ESP_LOGD(TAG, "Install panel IO for screen 2");
    const esp_lcd_panel_io_spi_config_t io_config_2 = {
        .dc_gpio_num = PIN_NUM_DC,
        .cs_gpio_num = PIN_NUM_CS_2,
        .pclk_hz = LCD_PIXEL_CLOCK_HZ,
        .lcd_cmd_bits = LCD_CMD_BITS_2,
        .lcd_param_bits = LCD_PARAM_BITS_2,
        .spi_mode = 0,
        .trans_queue_depth = 10,
    };
    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_HOST, &io_config_2, &io_handle_2), err, TAG,
                      "Failed to install panel IO (screen 2)");

    const esp_lcd_panel_dev_config_t panel_config_2 = {
        .reset_gpio_num = PIN_NUM_RST_2,
        #if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
            .color_space = ESP_LCD_COLOR_SPACE_BGR,
        #elif ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0)
            .rgb_endian = LCD_RGB_ENDIAN_BGR,
        #else
            .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_BGR,
        #endif
            .bits_per_pixel = LCD_BITS_PER_PIXEL_2,
    };
    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_nv3041(io_handle_2, &panel_config_2, &panel_handle_2), err, TAG,
                      "New panel failed (screen 2)");
    ESP_ERROR_CHECK(esp_lcd_panel_reset(panel_handle_2));
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle_2));
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle_2, true));
    ESP_ERROR_CHECK(esp_lcd_panel_invert_color(panel_handle_2, true));

    screen1_fill_color(0x0000);
    screen2_fill_color(0x0000);

    return ret;

    err:
        if (panel_handle) {
            esp_lcd_panel_del(panel_handle);
            panel_handle = NULL;
        }
        if (io_handle) {
            esp_lcd_panel_io_del(io_handle);
            io_handle = NULL;
        }
        if (panel_handle_2) {
            esp_lcd_panel_del(panel_handle_2);
            panel_handle_2 = NULL;
        }
        if (io_handle_2) {
            esp_lcd_panel_io_del(io_handle_2);
            io_handle_2 = NULL;
        }
        spi_bus_free(LCD_HOST);

    return ret;
}

esp_err_t app_lcd_deinit(void)
{
    esp_err_t ret = ESP_OK;
    if (panel_handle_2) {
        ESP_RETURN_ON_ERROR(esp_lcd_panel_del(panel_handle_2), TAG, "LCD panel 2 de-initialization failed");
        panel_handle_2 = NULL;
    }
    if (io_handle_2) {
        ESP_RETURN_ON_ERROR(esp_lcd_panel_io_del(io_handle_2), TAG, "LCD panel IO 2 de-initialization failed");
        io_handle_2 = NULL;
    }
    ESP_RETURN_ON_ERROR(esp_lcd_panel_del(panel_handle), TAG, "LCD panel de-initialization failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_del(io_handle), TAG, "LCD panel IO de-initialization failed");
    ESP_RETURN_ON_ERROR(spi_bus_free(LCD_HOST), TAG, "SPI bus de-initialization failed");
    return ret;
}

esp_err_t app_lvgl_init(void)
{
    const lvgl_port_cfg_t lvgl_cfg = ESP_LVGL_PORT_INIT_CONFIG();
    ESP_RETURN_ON_ERROR(lvgl_port_init(&lvgl_cfg), TAG, "Failed to initialize LVGL port");
    
    /* Add LCD Screen */
    ESP_LOGD(TAG, "Add LCD screen to LVGL");
    const lvgl_port_display_cfg_t disp_cfg = {
        .io_handle = io_handle,
        .panel_handle = panel_handle,
        .buffer_size = LCD_H_RES * LCD_DRAW_BUF_HEIGHT * sizeof(uint16_t),
        .double_buffer = LCD_DRAW_BUF_DOUBLE,
        .hres = LCD_H_RES,
        .vres = LCD_V_RES,
        .monochrome = false,
        //rotations
        .rotation = {
            .swap_xy = true,
            .mirror_x = false,
            .mirror_y = true,
        },
        .flags = {
            .buff_dma = true,
            #if LVGL_VERSION_MAJOR >= 9
            .swap_bytes = true,
            #endif
        }
    };
    lvgl_disp = lvgl_port_add_disp(&disp_cfg);

