Eric-C-E/ESP32-LLL/main/app_display.c
    const lvgl_port_display_cfg_t disp_cfg_2 = {
        .io_handle = io_handle_2,
        .panel_handle = panel_handle_2,
        .buffer_size = LCD_H_RES_2 * LCD_DRAW_BUF_HEIGHT_2 * sizeof(uint16_t),
        .double_buffer = LCD_DRAW_BUF_DOUBLE_2,
        .hres = LCD_H_RES_2,
        .vres = LCD_V_RES_2,
        .monochrome = false,
        .rotation = {
            .swap_xy = false,
            .mirror_x = true,
            .mirror_y = true,
        },
        .flags = {
            .buff_dma = SCREEN2_LVGL_DMA,
#if LVGL_VERSION_MAJOR >= 9
            .swap_bytes = SCREEN2_SWAP_BYTES,
#endif
        }
    };
    lvgl_disp_2 = lvgl_port_add_disp(&disp_cfg_2);
    if (!lvgl_disp_2) {
        ESP_LOGE(TAG, "LVGL disp 2 init failed");
    }

    return ESP_OK;
}

esp_err_t app_lvgl_deinit(void)
{
    if (lvgl_disp_2) {
        ESP_RETURN_ON_ERROR(lvgl_port_remove_disp(lvgl_disp_2), TAG, "LVGL disp 2 removing failed");
        lvgl_disp_2 = NULL;
    }
    ESP_RETURN_ON_ERROR(lvgl_port_remove_disp(lvgl_disp), TAG, "LVGL disp removing failed");
    ESP_RETURN_ON_ERROR(lvgl_port_deinit(), TAG, "LVGL deinit failed");

    return ESP_OK;
}

void display_task(void *arg)
{   /*
    The 240x240 screen is operator-facing, so it has RSSI indicator and REC/RDY indicators. 
    The 480x128 screen only has text.
    */
    lvgl_port_lock(0);
    show_boot_logo(lvgl_disp, LCD_H_RES, LCD_V_RES, true);
    show_boot_logo(lvgl_disp_2, LCD_H_RES_2, LCD_V_RES_2, true);
    lvgl_port_unlock();
    vTaskDelay(pdMS_TO_TICKS(5000));
    lvgl_port_lock(0);
    clear_display(lvgl_disp);
    clear_display(lvgl_disp_2);
    lvgl_port_unlock();

    lvgl_port_lock(0);
    /* screen one of two */
    lv_obj_t *scr = lv_scr_act();
    lv_obj_t *log_area = NULL;
    lv_obj_t *indicator_area = NULL;
    lv_obj_t *rdy_label = NULL;
    lv_obj_t *rec_dot = NULL;
    lv_obj_t *rssi_label = NULL;
    const int16_t text_x = 30;
    const int16_t text_y = 40;
    const int16_t text_w = 180;
    const int16_t text_h = 160;
    const int16_t indicator_w = 120;
    const int16_t indicator_h = 30;
    const int16_t indicator_x = text_x + (text_w - indicator_w) / 2;
    const int16_t indicator_y = text_y - indicator_h;

    /* screen two of two WIP */
    lv_obj_t *scr_2 = NULL;
    lv_obj_t *log_area_2 = NULL;
    const int16_t text_margin_2 = 8;
    const int16_t text_x_2 = text_margin_2;
    const int16_t text_y_2 = text_margin_2;
    const int16_t text_w_2 = LCD_H_RES_2 - (text_margin_2 * 2);
    const int16_t text_h_2 = LCD_V_RES_2 - (text_margin_2 * 2);

    lv_obj_set_style_bg_color(scr, lv_color_black(), 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);

    /* defining objects for screen 1 */
    indicator_area = lv_obj_create(scr);
    lv_obj_remove_style_all(indicator_area);
    lv_obj_set_size(indicator_area, indicator_w, indicator_h);
    lv_obj_set_pos(indicator_area, indicator_x, indicator_y);
    lv_obj_set_style_bg_opa(indicator_area, LV_OPA_TRANSP, 0);

    rdy_label = lv_label_create(indicator_area);
    lv_label_set_text(rdy_label, "RDY");
    lv_obj_set_style_text_color(rdy_label, lv_color_hex(0x2D6BFF), 0);
    lv_obj_align(rdy_label, LV_ALIGN_LEFT_MID, 0, 0);

    rec_dot = lv_obj_create(indicator_area);
    lv_obj_remove_style_all(rec_dot);
    lv_obj_set_size(rec_dot, 10, 10);
    lv_obj_set_style_radius(rec_dot, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_bg_color(rec_dot, lv_color_hex(0xFF2A2A), 0);
    lv_obj_set_style_bg_opa(rec_dot, LV_OPA_COVER, 0);
    lv_obj_align(rec_dot, LV_ALIGN_LEFT_MID, 2, 0);

    rssi_label = lv_label_create(indicator_area);
    lv_label_set_text(rssi_label, "RSSI --");
    lv_obj_set_style_text_color(rssi_label, lv_color_hex(0xFFFFFF), 0);
    lv_obj_align(rssi_label, LV_ALIGN_RIGHT_MID, 0, 0);

    log_area = lv_textarea_create(scr);
    lv_obj_set_size(log_area, text_w, text_h);
    lv_obj_set_pos(log_area, text_x, text_y);
    lv_textarea_set_max_length(log_area, 1024);
    lv_textarea_set_cursor_click_pos(log_area, false);
    lv_textarea_set_password_mode(log_area, false);
    lv_obj_add_state(log_area, LV_STATE_DISABLED);
    lv_obj_set_style_bg_opa(log_area, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_opa(log_area, LV_OPA_TRANSP, 0);
    lv_obj_set_style_text_color(log_area, lv_color_hex(0x00FF00), 0);
    lv_obj_set_style_text_outline_stroke_color(log_area, lv_color_hex(0x00FF00), 0);
    lv_obj_set_style_text_outline_stroke_opa(log_area, LV_OPA_COVER, 0);
    lv_obj_set_style_text_outline_stroke_width(log_area, 1, 0);
    lv_obj_set_style_pad_all(log_area, 2, 0);
    lv_obj_set_scrollbar_mode(log_area, LV_SCROLLBAR_MODE_OFF);

    const lv_font_t *log_font = lv_obj_get_style_text_font(log_area, LV_PART_MAIN);
    const int32_t line_space = lv_obj_get_style_text_line_space(log_area, LV_PART_MAIN);
    const int32_t letter_space = lv_obj_get_style_text_letter_space(log_area, LV_PART_MAIN);
    const int32_t pad_left = lv_obj_get_style_pad_left(log_area, LV_PART_MAIN);
    const int32_t pad_right = lv_obj_get_style_pad_right(log_area, LV_PART_MAIN);
    const int32_t pad_top = lv_obj_get_style_pad_top(log_area, LV_PART_MAIN);
    const int32_t pad_bottom = lv_obj_get_style_pad_bottom(log_area, LV_PART_MAIN);
    const uint16_t line_height = lv_font_get_line_height(log_font) + line_space;
    int32_t content_height = text_h - pad_top - pad_bottom;
    int32_t content_width = text_w - pad_left - pad_right;
    int max_lines = (line_height > 0) ? (content_height / line_height) : 1;
    if (max_lines < 1) {
        max_lines = 1;
    }
    if (max_lines > DISPLAY_MAX_LINES) {
        max_lines = DISPLAY_MAX_LINES;
    }
    if (content_width < 1) {
        content_width = 1;
    }

    const lv_font_t *log_font_2 = NULL;
    int32_t content_width_2 = 1;
    int max_lines_2 = 1;
    int32_t letter_space_2 = 0;
    if (lvgl_disp_2) {
        lv_display_t *prev_disp = lv_display_get_default();
        lv_display_set_default(lvgl_disp_2);
        scr_2 = lv_scr_act();
        lv_obj_set_style_bg_color(scr_2, lv_color_black(), 0);
        lv_obj_set_style_bg_opa(scr_2, LV_OPA_COVER, 0);

        log_area_2 = lv_textarea_create(scr_2);
        lv_obj_set_size(log_area_2, text_w_2, text_h_2);
        lv_obj_set_pos(log_area_2, text_x_2, text_y_2);
        lv_textarea_set_max_length(log_area_2, 1024);
        lv_textarea_set_cursor_click_pos(log_area_2, false);
        lv_textarea_set_password_mode(log_area_2, false);
        lv_obj_add_state(log_area_2, LV_STATE_DISABLED);
        lv_obj_set_style_bg_opa(log_area_2, LV_OPA_TRANSP, 0);
        lv_obj_set_style_border_opa(log_area_2, LV_OPA_TRANSP, 0);
        lv_obj_set_style_text_color(log_area_2, lv_color_hex(0xFFFFFF), 0);
        lv_obj_set_style_text_outline_stroke_color(log_area_2, lv_color_hex(0xFFFFFF), 0);
        lv_obj_set_style_text_outline_stroke_opa(log_area_2, LV_OPA_COVER, 0);
        lv_obj_set_style_text_outline_stroke_width(log_area_2, 1, 0);
        lv_obj_set_style_pad_all(log_area_2, 4, 0);
        lv_obj_set_scrollbar_mode(log_area_2, LV_SCROLLBAR_MODE_OFF);
#if LV_FONT_MONTSERRAT_28
        lv_obj_set_style_text_font(log_area_2, &lv_font_montserrat_28, 0);
#endif

        log_font_2 = lv_obj_get_style_text_font(log_area_2, LV_PART_MAIN);
        const int32_t line_space_2 = lv_obj_get_style_text_line_space(log_area_2, LV_PART_MAIN);
        letter_space_2 = lv_obj_get_style_text_letter_space(log_area_2, LV_PART_MAIN);
        const int32_t pad_left_2 = lv_obj_get_style_pad_left(log_area_2, LV_PART_MAIN);
        const int32_t pad_right_2 = lv_obj_get_style_pad_right(log_area_2, LV_PART_MAIN);
        const int32_t pad_top_2 = lv_obj_get_style_pad_top(log_area_2, LV_PART_MAIN);
        const int32_t pad_bottom_2 = lv_obj_get_style_pad_bottom(log_area_2, LV_PART_MAIN);
        const uint16_t line_height_2 = lv_font_get_line_height(log_font_2) + line_space_2;
        int32_t content_height_2 = text_h_2 - pad_top_2 - pad_bottom_2;
        content_width_2 = text_w_2 - pad_left_2 - pad_right_2;
        max_lines_2 = (line_height_2 > 0) ? (content_height_2 / line_height_2) : 1;
        if (max_lines_2 < 1) {
            max_lines_2 = 1;
        }
        if (max_lines_2 > DISPLAY_MAX_LINES_2) {
            max_lines_2 = DISPLAY_MAX_LINES_2;
        }
        if (content_width_2 < 1) {
            content_width_2 = 1;
        }
        lv_display_set_default(prev_disp);
    }

