Eric-C-E/ESP32-LLL/main/app_display.c
    ESP_LOGI(TAG, "display task running");
    lvgl_port_unlock();

    static log_line_t lines[DISPLAY_MAX_LINES];
    static log_line_t lines_2[DISPLAY_MAX_LINES_2];
    static int line_count = 0;
    static int line_count_2 = 0;
    QueueHandle_t disp1_q = tcp_rx_get_disp1_q();
    QueueHandle_t disp2_q = tcp_rx_get_disp2_q();
    TickType_t last_indicator_update = 0;
    TickType_t last_prune = 0;
    TickType_t last_prune_2 = 0;
    const TickType_t max_age_2 = pdMS_TO_TICKS(DISPLAY_LINE_MAX_AGE_MS_2);
    const char *init_text_1 = "Live Language Lens READY";
    const char *init_text_2 = "Live Language Lens READY";

    text_msg_t init_msg = { 0 };
    size_t init_len = strlen(init_text_1);
    init_msg.len = (uint16_t)init_len;
    memcpy(init_msg.payload, init_text_1, init_len);
    if (disp1_q && xQueueSend(disp1_q, &init_msg, 0) != pdTRUE) {
        ESP_LOGW(TAG, "display_task: init text enqueue failed for screen1");
    }
    init_msg.len = (uint16_t)strlen(init_text_2);
    memcpy(init_msg.payload, init_text_2, init_msg.len);
    if (disp2_q && xQueueSend(disp2_q, &init_msg, 0) != pdTRUE) {
        ESP_LOGW(TAG, "display_task: init text enqueue failed for screen2");
    }

    while (1) {
        text_msg_t msg;
        text_msg_t msg_2;
        bool got_msg = false;
        bool got_msg_2 = false;
        if (disp1_q) {
            if (xQueueReceive(disp1_q, &msg, pdMS_TO_TICKS(100)) == pdTRUE) {
                got_msg = true;
            }
        } else if (!disp2_q) {
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        if (disp2_q) {
            TickType_t wait_ticks = disp1_q ? 0 : pdMS_TO_TICKS(100);
            if (xQueueReceive(disp2_q, &msg_2, wait_ticks) == pdTRUE) {
                got_msg_2 = true;
            }
        }

        TickType_t now = xTaskGetTickCount();
        bool prune_needed = (now - last_prune) > pdMS_TO_TICKS(200);
        bool indicator_needed = (now - last_indicator_update) > pdMS_TO_TICKS(250);
        bool prune_needed_2 = (now - last_prune_2) > pdMS_TO_TICKS(200);

        if (got_msg) {
            size_t copy_len = msg.len;
            if (copy_len > TEXT_BUF_SIZE) {
                copy_len = TEXT_BUF_SIZE;
            }
            char line_buf[TEXT_BUF_SIZE + 1];
            memcpy(line_buf, msg.payload, copy_len);
            line_buf[copy_len] = '\0';
            for (size_t i = 0; i < copy_len; i++) {
                if (line_buf[i] == '\r' || line_buf[i] == '\n') {
                    line_buf[i] = ' ';
                }
            }

            lvgl_port_lock(0);
            prune_expired_lines(lines, &line_count, now);
            add_wrapped_lines(lines, &line_count, max_lines, line_buf, now, log_font,
                              content_width, letter_space);
            rebuild_log_textarea(log_area, lines, line_count, max_lines);
            lvgl_port_unlock();
        }

        if (got_msg_2 && log_area_2) {
            size_t copy_len = msg_2.len;
            if (copy_len > TEXT_BUF_SIZE) {
                copy_len = TEXT_BUF_SIZE;
            }
            char line_buf[TEXT_BUF_SIZE + 1];
            memcpy(line_buf, msg_2.payload, copy_len);
            line_buf[copy_len] = '\0';
            for (size_t i = 0; i < copy_len; i++) {
                if (line_buf[i] == '\r' || line_buf[i] == '\n') {
                    line_buf[i] = ' ';
                }
            }

            lvgl_port_lock(0);
            prune_expired_lines_with_age(lines_2, &line_count_2, now, max_age_2);
            add_wrapped_lines(lines_2, &line_count_2, max_lines_2, line_buf, now, log_font_2,
                              content_width_2, letter_space_2);
            rebuild_log_textarea(log_area_2, lines_2, line_count_2, max_lines_2);
            lvgl_port_unlock();
        }

        if (prune_needed) {
            bool changed = false;
            lvgl_port_lock(0);
            int before = line_count;
            prune_expired_lines(lines, &line_count, now);
            changed = (before != line_count);
            if (changed) {
                rebuild_log_textarea(log_area, lines, line_count, max_lines);
            }
            lvgl_port_unlock();
            last_prune = now;
        }

        if (prune_needed_2 && log_area_2) {
            bool changed = false;
            lvgl_port_lock(0);
            int before = line_count_2;
            prune_expired_lines_with_age(lines_2, &line_count_2, now, max_age_2);
            changed = (before != line_count_2);
            if (changed) {
                rebuild_log_textarea(log_area_2, lines_2, line_count_2, max_lines_2);
            }
            lvgl_port_unlock();
            last_prune_2 = now;
        }

        if (indicator_needed) {
            app_gpio_state_t state = gpio_get_state();
            int8_t rssi = wifi_get_rssi();
            char rssi_buf[16];
            lvgl_port_lock(0);
            if (state == APP_GPIO_STATE_IDLE) {
                lv_label_set_text(rdy_label, "RDY");
                lv_obj_align(rdy_label, LV_ALIGN_LEFT_MID, 0, 0);
                lv_obj_clear_flag(rdy_label, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(rec_dot, LV_OBJ_FLAG_HIDDEN);
            } else {
                lv_obj_add_flag(rdy_label, LV_OBJ_FLAG_HIDDEN);
                lv_obj_clear_flag(rec_dot, LV_OBJ_FLAG_HIDDEN);
            }
            snprintf(rssi_buf, sizeof(rssi_buf), "RSSI %d", (int)rssi);
            lv_label_set_text(rssi_label, rssi_buf);
            lv_obj_align(rssi_label, LV_ALIGN_RIGHT_MID, 0, 0);
            lvgl_port_unlock();
            last_indicator_update = now;
        }
    }
}

void display_make_tasks(void)
{
    ESP_ERROR_CHECK(app_lcd_init());
    ESP_ERROR_CHECK(app_lvgl_init());
    xTaskCreatePinnedToCore(display_task, "display_task", 8192, NULL, 6, NULL, 1);
}
